{
  "recent": {
    "Perennial Favorite": "Consistently high popularity across decades. Timeless appeal with stable demand.",
    "Modern Hit": "Strong sustained popularity with continued growth. Already well-established and still gaining momentum.",
    "Moderate Classic": "Steady popularity maintained across generations. Reliable presence with gradual upward trend.",
    "Rising Star": "Dramatic growth with strong upward momentum. Rapidly gaining popularity and visibility.",
    "Rapid Riser": "Explosive growth from minimal presence. Rising trajectory showing rapid adoption.",
    "Rising Uncommon": "Growing steadily from rare to uncommon. Building momentum with positive trajectory.",
    "Emerging Rare Names": "Slow growth from minimal levels. Gaining traction but still very rare overall.",
    "Fading Mega-Hit": "Former blockbusters showing significant decline. Historical favorites experiencing reduced usage.",
    "Declining Former Favorite": "Well-established names experiencing downward trajectory. Strong past presence now fading.",
    "Fading Classic": "Fell from popular status below 500 average. Strong historical presence now diminished.",
    "Declining Uncommon": "Approached popularity threshold but declining. Once moderately common, now less frequent.",
    "Extremely Rare": "Very low usage with slight decline. Typically under 10 babies per year at peak.",
    "Almost Unique": "Minimal usage remaining stable. Rare cultural or unique names with very small presence.",
    "Uncategorized recent pattern": "Does not fit clearly into any defined classification pattern"
  },
  "historic": {
    "Steady Classic": "Long-term presence with high rankings",
    "Fallen Classic": "Long-term favourite recently dropped from the rankings",
    "Declining Former Favorite": "Worsening rank over time (moving down)",
    "Recent Entrant": "New to top 100, emerged in 2000s or later",
    "Vintage Revival": "Names from the 20th century that have returned to popularilty",
    "Pendulum": "Swinging in and out of fashion",
    "Lost Generation": "Popular in early decades, no longer in top 100",
    "Unranked": "This name has never reached the top 100. Perhaps it is just biding its time."
  }
}
